# 1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
# https://drive.google.com/file/d/1TrsfcbQ_r2kMn5ZVBMEZbtlQF0rz3chd/view?usp=sharing

a = input('Введите трехзначное число: ')    # input выдает строку

print(int(a[0])+int(a[1])+int(a[2]))
print(int(a[0])*int(a[1])*int(a[2]))